# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe'
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached


# Development
brew 'php'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'npm'

# Apps
cask '1password'
cask '1password-cli'
cask 'alfred'
cask 'dash'
cask 'discord'
cask 'figma'
cask 'firefox'
cask 'google-chrome'
cask 'gpg-suite'
cask 'karabiner-elements'
cask 'java'
cask 'phpstorm'
cask 'screenflow'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'sublime-merge'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'tor-browser'
cask 'transmission'
cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'